import matplotlib.pyplot as plt
# 10 12.804 секунд
# 11 27.576 секунд
# 12 70.065 секунд
# 13 142.771 секунд
# 14 319.331 секунд
# 15 1692.958 sec
X1 = [10000,11000,12000,13000,14000,15000]
X2 = [9000, 10000,11000,12000,13000,14000,15000, 16000, 17000]
T1 = [12.804, 27.576, 70.065, 142.771, 319.331, 1692.958]
T2 = [0.354,0.396,0.4,0.43,0.49,0.491,0.574,0.6,0.619]

plt.scatter(X1, T1, color='red', label='Перебором')
plt.xlabel('Нагрузка людей')
plt.ylabel('Время выполнения, секунды')
plt.legend()
plt.grid()
plt.show()
plt.scatter(X2, T2, color='green', label='Генетический алгоритм')
plt.xlabel('Нагрузка людей')
plt.ylabel('Время выполнения')
plt.legend()
plt.grid()
plt.show()